app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY movies.title DESC
---
  def index

    @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL LIMIT 1
---
  def similar
    @movie = Movie.find(params[:id])
    if (@movie.director != '')
      @movies = Movie.where(:director => @movie.director)